Revit 2024 API
GroupNode Class
 A node that represents set of individual elements grouped together in some form, such as an instance of a family or linked Revit file, or an instance of a part of symbol's geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class GroupNode : RenderNode
Visual Basic
Public Class GroupNode _
	Inherits RenderNode
Visual C++
public ref class GroupNode : public RenderNode
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.GroupNode
 Autodesk.Revit.DB.InstanceNode
 Autodesk.Revit.DB.LinkNode
See Also
GroupNode Members
Autodesk.Revit.DB Namespace